12/data/attachments/dafa6d477ba9bd1b.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_679213f0-1ef1-4869-9c54-b1670eafb22c</nif:username>
            <nif:friendToBeAdded>Darrell_large_Friend_67444_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>